id: 29c5111b-6429-40f8-a28a-97ea061c6e51
name: Potential MFA Fatigue attack
description: This alert detects multiple rejected MFA requests from one IP address.
severity: Medium
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - SigninLogs
queryFrequency: 15m
queryPeriod: 15m
triggerOperator: gt
triggerThreshold: 0
query: |
  let timeframe = 15m;
  let threshold = 3;
  SigninLogs
  | where TimeGenerated >= ago(timeframe)
  | where ResultType == "500121"
  | summarize DeniedCount = count(), LastActivity = max (TimeGenerated) by UserPrincipalName, IPAddress
  | where DeniedCount >= threshold
  | project UserPrincipalName, AttackerIP = IPAddress, DeniedCount, CompromiseTime = LastActivity
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: UserPrincipalName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: AttackerIP